---
type: SpecUtils
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# SpecUtils

`Autodesk.Revit.DB.SpecUtils` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetAllSpecs | 2022 | `public static IList < ForgeTypeId > GetAllSpecs ()` |
| Method | IsSpec | 2022 | `public static bool IsSpec ( ForgeTypeId specTypeId )` |
| Method | IsValidDataType | 2022 | `public static bool IsValidDataType ( ForgeTypeId dataType )` |